
















# Задача 3
# n = input()
# n = n.replace(",", " ")
# n = n.replace(";", " ")
# n = n.replace("...", " ")
# print(n)

# задача 4
# lum = [i for i in range(5, 10000000, 5) if i % 10 == 5]
# print(lum)

# задача 5
# import re
# n = input('Введите номер телефона: ')
# p=re.compile(r'\+{1}[0-9]{11}')
# if p.match(n):
#     print('YES')
# else:
#     print('NO')

# задача 6
# n=input('Введите выражение: ')
# otv = eval(n)
# print(f'Выражение равно {otv}')

# задача 7
# a=input('Введите положительное число в двоичной системе счисления: ')
# b=input('Введите отрицательное число в двоичной системе счисления: ')
# z = int(a,2)+int(b,2)
# print(z)
# print(bin(z)[2:])