"""
n человек, пронумерованных числами от 1 до
n, стоят в кругу. Они начинают считаться, каждый
k-й по счету человек выбывает из круга, после чего
счет продолжается со следующего за ним человека.
Напишите программу, определяющую номер человека, который останется в кругу последним.
"""

# round_num = int(input())
# exit_number = int(input())
# l = []
# for i in range(1, round_num + 1):
#     l += [i]
# ind = 0
# while len(l) != 1:
#     ind = (ind + exit_number - 1) % len(l)
#     l.pop(ind)
#     print(l)
# print(*l)
