# 1 цикл FOR
# number = 10
#
# if number > 0:
#     print("Положительное число")
# elif number == 0:
#     print("Нулевое число")
# else:
#     print("Отрицательное число")
#
# 2 FOR
# for i in  range(10):
#     print(i)
#
# 3 цикл while
# count = 1
# while count <= 5:
#     print(count)
#     count += 1
#
# 4 FUNCTION
# def square(x):
#     return x * x
#
# result = square(4)
# print("Квадрат числа 4 равен", result)
#
# 5 list('списки'-МЕНЯЮТС
# numbers = [1, 2, 3, 4, 5]
# names = ["Ольга", "Борис", "Сергей"]
# print(names,numbers)
#
# 6 tuple(кортежи)-НЕ МЕНЯЮТСЯ
# coordinates = (10, 20)
# colors = ("red", "green", "blue")
# print(colors[0])
#
# 7 set (множества):
# Множества (set) представляют собой неупорядоченные коллекции уникальных элементов. В множестве не может быть повторяющихся элементов,
# и элементы не имеют определённого порядка. Множества полезны для операций с уникальными значениями и для быстрого поиска.
# unique_numbers = {1, 2, 3, 4, 5}
# letters = {"a", "b", "c"}
# print(letters)
#
# 8 dict (словари):
# Словари (dict) представляют собой коллекции пар «ключ-значение». В словаре каждый элемент (ключ) связан с определённым значением.
# Ключи в словаре должны быть уникальными и неизменяемыми (например, строки, числа), а значения могут быть любого типа.
# person = {"name": "Ольга", "age": 20, "city": "Москва"}
# scores = {"Математика": 95, "Физика": 88, "Русский язык": 92}
# print(person['age'])